{"code": 0, "data": {"collectionMetadata": {"collectionId": "154", "createdAt": "2016-05-11T18:36:29+08:00", "name": "Demand for Rental and Sold Flats", "description": "Key Stats since 1960. Data can also be found in HDB's Annual Reports under Key Statistics: http://www.hdb.gov.sg/cs/infoweb/about-us/news-and-publications/annual-reports ", "lastUpdatedAt": "2024-12-02T18:14:45+08:00", "coverageStart": "1960-01-01T08:00:00+08:00", "coverageEnd": "2021-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Housing & Development Board"], "managedBy": "Housing & Development Board", "childDatasets": ["d_4b4ee36346b27fe35c529588900340b2"]}, "datasetMetadata": [{"datasetId": "d_4b4ee36346b27fe35c529588900340b2", "createdAt": "2016-05-12T02:38:40+08:00", "name": "Demand for Rental and Sold Flats", "collectionIds": ["154"], "description": "* Figures for 1960-1965 Home Ownership Flats (i.e. 2,967) are only for applications received in 1964 and 1965 to purchase Home Ownership flats.\r\n* Figures for FY 2014/15 include projected bookings for Sep 2014, Nov 2014 and Feb 2015 Build-To-Order and Nov 2014 Sales of Balance Flats exercises as their selection exercises are either on-going or have yet to commence as at 31 Mar 2015.\r\n* Figures for FY 2015/16 include projected bookings for Nov 2015 and Feb 2016 Build-To-Order and Nov 2015 Sales of Balance Flats exercises as their selection exercises are either on-going or have yet to commence as at 31 Mar 2016.\r\n\r\ni) From FY 1989/1990 applicants for resale flats are not included in the figures on demand for Home Ownership flats.\r\n\r\nii) Demand for flats from FY 1991/1992 to FY 1993/1994 refers to new requests received for direct purchase flats in mature and non-mature estates under the Booking System.\r\n\r\niii) Figures from FY 1994/1995 to FY 1996/1997 include new applications received under  the Registration for Flat System (RFS) and new requests made for mature estates during the year.  The new requests for flats in mature estates exclude requests from applicants who were on the RFS queue and those who had previously applied for flats in mature estates.\r\n\r\niv) Figures from FY 1997/1998 to FY 2001/2002 refer to new applications received under RFS and bookings under Walk-In-Selection (WIS). Data includes Studio Apartments, 3-room and bigger flats.\r\n\r\nv) Figures from FY 2003/2004 to FY 2014/2015 are based on bookings received by HDB for Studio Apartments and bigger flats under the various allocation exercises, as well as bookings under the Design, Build and Sell Scheme (DBSS).\r\n\r\nvi) There were no DBSS launches in FY 2016 and FY 2017.", "format": "CSV", "lastUpdatedAt": "2024-12-02T18:14:45+08:00", "managedBy": "Housing & Development Board", "coverageStart": "1960-01-01T08:00:00+08:00", "coverageEnd": "2023-03-31T23:59:59+08:00"}]}, "errorMsg": ""}