{"code": 0, "data": {"collectionMetadata": {"collectionId": "462", "createdAt": "2016-03-24T16:25:28+08:00", "name": "Government Budget and Fiscal Position, Annual", "description": "Fiscal position may not be fully comparable across financial years due to the reclassification of revenue and expenditure items over time. \r\n\r\nThe Government's financial year begins on 1 April of the current year and ends on 31 March of the following year. \r\n\r\nFigures may not add up due to rounding. ", "lastUpdatedAt": "2024-06-06T15:02:17+08:00", "coverageStart": "1997-01-01T08:00:00+08:00", "coverageEnd": "2024-03-31T08:00:00+08:00", "frequency": "annual", "sources": ["Ministry of Finance"], "managedBy": "Ministry of Finance", "childDatasets": ["d_2ceefcf18f04feba153b9768652be854", "d_6a804a6860b5c51af08df679a71bc190", "d_d6cd701a67607ac9d4f3d469d8c815e5", "d_0f0800a6b2b4b391daffcd88b2cc97fd"]}, "datasetMetadata": [{"datasetId": "d_2ceefcf18f04feba153b9768652be854", "createdAt": "2018-02-20T11:25:56+08:00", "name": "Government Manpower", "collectionIds": ["462"], "description": "Establishments reflect the number of officers that ministries can hire, but are not reflective of actual headcount, as establishments may not be filled by ministries even though they may be kept in anticipation of a future need. Figures for FY1997 to FY2022 are for actual headcount. Figures for FY2023 are for revised establishments. Figures for FY2024 are for budgeted establishments.\n\nFrom Oct 2023, the Smart Nation and Digital Government Group under the Prime Minister's Office (PMO) has merged with Ministry of Communications and Information (MCI)’s digital development functions to form an enlarged Smart Nation Group to better position the Government to advance the full range of the digital agenda. The new Smart Nation Group programme and Government Technology Agency programme will be reported under MCI from FY2024. Figures before FY2024 are reported under PMO. \n", "format": "CSV", "lastUpdatedAt": "2024-06-06T14:29:14+08:00", "managedBy": "Ministry of Finance"}, {"datasetId": "d_6a804a6860b5c51af08df679a71bc190", "createdAt": "2016-03-25T02:50:17+08:00", "name": "Government Expenditure by Type", "collectionIds": ["462"], "description": "Total Expenditure comprises Operating Expenditure and Development Expenditure. Development Expenditure excludes land-related expenditure from FY2001.", "format": "CSV", "lastUpdatedAt": "2024-06-06T14:40:50+08:00", "managedBy": "Ministry of Finance"}, {"datasetId": "d_d6cd701a67607ac9d4f3d469d8c815e5", "createdAt": "2016-03-25T00:44:22+08:00", "name": "Government Operating Revenue", "collectionIds": ["462"], "description": "Operating Revenue refers to Government receipts credited to the Consolidated Revenue Account and Development Fund Account, excluding Investment and Interest Income, and Capital Receipts (lumpy and less regular in timing). The main components are Corporate Income Tax, Personal Income Tax, and Goods and Services Tax.\n\nWithholding Tax-A non-resident is liable to pay income tax on Singapore-sourced income. Under the law, when a person makes payment of a specified nature to a non-resident, he has to withhold a percentage of that payment and pay the\namount withheld to IRAS. The amount withheld is the Withholding Tax.\n\nAssets Taxes refer to Property Tax and Estate Duty. Property Tax is a tax on the ownership of property and is payable by all property owners on the properties owned by them. Estate Duty is a tax on the total market value of a person's\nassets (cash and non-cash) at the date of his or her death. Estate Duty does not apply to a person who dies after 15 February 2008. \n\nCustoms Duties refer to taxes on goods imported into Singapore. In Singapore, Customs Duties are principally\nimposed on alcoholic beverages.\n\nExcise Duties refer to taxes on goods, whether manufactured in Singapore or elsewhere. In Singapore, Excise Duties are imposed principally on tobacco, petroleum products, motor vehicles and liquor.\n\nMotor Vehicles Taxes comprise additional registration fees, road tax, special tax on heavy-oil engines, passenger vehicle seating fees and non-motor vehicle licences, but exclude excise duties on motor vehicles which are classified under Customs, Excise and Carbon Taxes.\n\nStamp Duty is a tax imposed on commercial and legal documents relating to unlisted stocks and shares and immovable property.\n\nOther Taxes include the Foreign Worker Levy, Water Conservation Tax, Land Betterment Charge, and Annual Tonnage Tax. Since 1 August 2022, Land Betterment Charge has replaced Differential Premium, Development Charge, and Temporary Development Levy.\n\nOther Fees and Charges include Licenses, Permits, Service Fees, Sales of Goods, Rental of Premises, Fines and Forfeitures and Reimbursements.", "format": "CSV", "lastUpdatedAt": "2024-06-06T15:02:17+08:00", "managedBy": "Ministry of Finance"}, {"datasetId": "d_0f0800a6b2b4b391daffcd88b2cc97fd", "createdAt": "2016-03-25T00:29:22+08:00", "name": "Government Fiscal Position", "collectionIds": ["462"], "description": "'Operating Revenue' refers to Government receipts credited to the Consolidated Revenue Account and Development Fund, excluding Investment and Interest Income, and Capital Receipts  (lumpy and less regular in timing). The main components are Corporate Income Tax, Personal Income Tax, and Goods and Services Tax. \n\n'Total Expenditure' comprises Operating Expenditure and Development Expenditure. Development Expenditure excludes land-related expenditure from FY2001.\n\n'Special Transfers Excluding Top-ups to Endowment and Trust Funds' refers to discretionary transfers made by the Government and these include one-off direct transfers to businesses and households.\n\n'Top-ups to Endowment and Trust Funds' refers to top-ups to endowment and trust funds created by the Government for specific expenditure objectives. \n\n'Net Investment Income/Returns Contribution' (NIRC) is the sum of: (1) up to 50% of the expected long-term real return on the relevant assets specified in the Constitution; and (2) up to 50% of the net investment income on the remaining assets.\n\nThe Primary Budget Position, defined as Operating Revenue less Total Expenditure, measures the ability of the Government to meet its annual expenditures through its regular collection of revenue (taxes, fees and charges).\n\nThe Basic Budget Position, which is the Surplus/Deficit before Top-ups to Endowment and Trust Funds and Net Investment Income/Returns Contribution, gives an indication of the annual impact of Government’s revenue and expenditure on the economy.\n\nThe Overall Fiscal Position shows the Government’s annual overall budget position based on Singapore's Constitutional framework.", "format": "CSV", "lastUpdatedAt": "2024-06-06T14:23:28+08:00", "managedBy": "Ministry of Finance"}]}, "errorMsg": ""}