{"code": 0, "data": {"collectionMetadata": {"collectionId": "461", "createdAt": "2022-03-03T21:58:44+08:00", "name": "Government Overall Fiscal Position (FY1997 to FY2023)", "description": "This dataset shows the Government Overall Fiscal Position over time (from 1997 to 2022). It comprise the figures of Operating Revenue (by types), Expenditure (by sector), Special Transfers (including Top-ups to Endowment and Trust Funds), Net Investment Returns Contribution, Interest Cost and Loan Expenses, and the Capitalisation and Depreciation of Nationally Significant Infrastructure.", "lastUpdatedAt": "2024-06-06T14:20:10+08:00", "coverageStart": "1997-01-01T08:00:00+08:00", "coverageEnd": "2024-03-31T08:00:00+08:00", "frequency": "annual", "sources": ["Ministry of Finance"], "managedBy": "Ministry of Finance", "childDatasets": ["d_00f95040967791729d51bd7cd6af2355"]}, "datasetMetadata": [{"datasetId": "d_00f95040967791729d51bd7cd6af2355", "createdAt": "2022-03-03T22:09:41+08:00", "name": "Government Total Expenditure", "collectionIds": ["461"], "description": "Total Expenditure comprises Operating Expenditure and Development Expenditure. Development Expenditure excludes land-related expenditure from FY2001.\n\nOperating Expenditure refers to expenditure on manpower, other operating expenditure (excluding expenses on investment and agency fees on land sales), operating grants and transfers.\n\nRefinements have been made over time to the sectoral classification of Ministries' expenditure to better reflect the nature of the programmes.\n\nFrom Oct 2023, the Smart Nation and Digital Government Group under the Prime Minister's Office (PMO) has merged with the Ministry of Communications and Information(MCI)’s digital development functions to form an enlarged Smart Nation Group to better position the Government to advance the full range of the digital agenda. The new Smart Nation Group programme and Government Technology Agency programme will be reported under MCI from FY2024. Figures before FY2024 are reported under PMO.", "format": "CSV", "lastUpdatedAt": "2024-06-06T14:20:10+08:00", "managedBy": "Ministry of Finance"}]}, "errorMsg": ""}