{"code": 0, "data": {"collectionMetadata": {"collectionId": "414", "createdAt": "2016-01-05T14:39:38+08:00", "name": "Government Recurrent Expenditure on Education Per Student", "description": "\t1)     Preliminary figures.\r\n\t2)\tFigures exclude Independent Schools.\r\n\t3)\tRefers to full-time Nitec / Higher Nitec courses offered by the Institute of Technical Education (ITE). Publicly-funded full-time diploma courses offered\r\nby ITE are included under “Publicly-funded full-time diploma courses\" from FY2012 onwards. From revised FY2018, it also includes funding to National Institute of Early Childhood Development (NIEC) offering publicly-funded full-time Higher Nitec courses.     \r\n\t4)\tRefers to publicly-funded full-time diploma courses offered by Singapore Polytechnic, Ngee Ann Polytechnic, Temasek Polytechnic,  Nanyang Polytechnic and Republic Polytechnic. Since FY2012, it includes publicly-funded full-time diploma courses offered by ITE, LASALLE of the Arts (LASALLE) and\r\nNanyang Academy of Fine Arts (NAFA). From revised FY2018, it also includes funding to NIEC offering publicly-funded full-time diploma courses.\r\n\t5)\tRefers to publicly-funded full-time degree courses offered by National University of Singapore, Nanyang Technological University, Singapore Management University, Singapore Institute of Technology, Singapore University of Technology and Design, LASALLE, NAFA and SIM University (renamed as Singapore University of Social Sciences wef 2016)  from FY2014.\r\n\r\n", "lastUpdatedAt": "2024-06-06T15:27:19+08:00", "coverageStart": "1986-01-01T08:00:00+08:00", "coverageEnd": "2021-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Ministry of Education"], "managedBy": "Ministry of Education", "childDatasets": ["d_d1c04ad1a201a76b0ab7753a498b3bfb"]}, "datasetMetadata": [{"datasetId": "d_d1c04ad1a201a76b0ab7753a498b3bfb", "createdAt": "2016-01-06T16:24:35+08:00", "name": "Government Recurrent Expenditure on Education Per Student", "collectionIds": ["414"], "description": "(1) Preliminary figures.\t\t\t\t\t\t\n(2) Figures exclude Independent Schools.\t\t\t\t\t\t\n(3) Refers to full-time Nitec / Higher Nitec courses offered by the Institute of Technical Education (ITE). Publicly-funded full-time diploma courses offered by ITE are included under “Publicly-funded full-time diploma courses\" from FY2012 onwards. From revised FY2018, it also includes funding to National Institute of Early Childhood Development (NIEC) offering publicly-funded full-time Higher Nitec courses.       \t\t\t\t\t\t\n(4) Refers to publicly-funded full-time diploma courses offered by Singapore Polytechnic, Ngee Ann Polytechnic, Temasek Polytechnic, Nanyang Polytechnic and Republic Polytechnic. Since FY2012, it includes publicly-funded full-time diploma courses offered by ITE, LASALLE College of the Arts (LASALLE) and Nanyang Academy of Fine Arts (NAFA). From revised FY2018, it also includes funding to NIEC offerring publicly-funded full-time diploma courses.\t\t\n(5) Refers to publicly-funded full-time degree courses offered by National University of Singapore, Nanyang Technological University, Singapore Management University, Singapore Institute of Technology, Singapore University of Technology and Design, LASALLE, NAFA and SIM University (renamed as Singapore University of Social Sciences wef 2016) from FY2014.\t\t\t\t\t\t", "format": "CSV", "lastUpdatedAt": "2024-06-06T15:27:19+08:00", "managedBy": "Ministry of Education", "coverageStart": "1986-01-01T08:00:00+08:00", "coverageEnd": "2022-01-01T08:00:00+08:00"}]}, "errorMsg": ""}