{"code": 0, "data": {"collectionMetadata": {"collectionId": "1480", "createdAt": "2018-11-07T19:07:50+08:00", "name": "Heritage Road Green Buffers", "description": "The Heritage Roads scheme was implemented by the Government in 2005 to recognise and protect roads with lush roadside trees and multi-layered vegetation that create \"green walls\" and \"green tunnels\" effects along certain roads.\n\nThe data show the extent of the Heritage Road Green Buffer whereby written approval must be obtained from the Commissioner of Parks & Recreation for the cutting or removal of any tree or plant within the designated Heritage Road Green Buffer. This includes any altering, closing up or removal of any Heritage Road Green Buffer; erecting or placing of any structure or object (whether temporary or permanent) in, above, across or under any Heritage Road Green Buffer; and erecting, constructing or laying within any Heritage Road Green Buffer any fence, retaining wall, foundation, manhole, pipe, cable, mains or any obstruction or structure (whether temporary or permanent).", "lastUpdatedAt": "2024-11-25T12:23:38+08:00", "frequency": "ad-hoc", "sources": ["National Parks Board"], "managedBy": "National Parks Board", "childDatasets": ["d_9233bdb05de067c3b3db21b836467a6a"]}, "datasetMetadata": [{"datasetId": "d_9233bdb05de067c3b3db21b836467a6a", "createdAt": "2023-07-31T16:06:28+08:00", "name": "Heritage Road Green Buffers", "collectionIds": ["1480"], "description": "The Heritage Roads scheme was implemented by the Government in 2005 to recognise and protect roads with lush roadside trees and multi-layered vegetation that create \"green walls\" and \"green tunnels\" effects along certain roads. The data show the extent of the Heritage Road Green Buffer whereby written approval must be obtained from the Commissioner of Parks & Recreation for the cutting or removal of any tree or plant within the designated Heritage Road Green Buffer. This includes any altering, closing up or removal of any Heritage Road Green Buffer; erecting or placing of any structure or object (whether temporary or permanent) in, above, across or under any Heritage Road Green Buffer; and erecting, constructing or laying within any Heritage Road Green Buffer any fence, retaining wall, foundation, manhole, pipe, cable, mains or any obstruction or structure (whether temporary or permanent).", "format": "GEOJSON", "lastUpdatedAt": "2024-11-25T12:23:38+08:00", "managedBy": "National Parks Board"}]}, "errorMsg": ""}