{"code": 0, "data": {"collectionMetadata": {"collectionId": "512", "createdAt": "2015-07-06T11:18:03+08:00", "name": "Hospital Admissions And Public Sector Outpatient Attendances, Annual", "description": "Data exclude Jurong Medical Centre.  \r\n\r\nTotal Hospital Admissions - Refers to inpatient discharges for all hospitals.  Prior to 2002, data on public sector hospitals refer to admissions.  \r\n\r\nPublic Sector Hospital Admissions - Public sector hospitals include government hospitals, government restructured hospitals and specialty centres.  \r\n\r\nPrivate Sector Hospital Admissions - Private sector hospitals include community hospitals and chronic sick hospitals; such as, \r\n\r\n1.   Ren Ci Hospital (formerly chronic sick unit in Woodbridge Hospital) with effect from 1 September 1994, \r\n2.   St. Luke's Hospital which opened with effect from 1 March 1996, \r\n3.   Westpoint family hospital which re-opened its inpatient service with effect from 28 June 2000.  \r\n4.  With effect from July 2012, data include Mount Elizabeth Novena Hospital.  \r\n5.  With effect from August 2012, data include Fortis Colorectal Hospital.  With effect from 15 December 2014, data include Farrer Park Hospital.  \r\n\r\nSpecialist Outpatient Clinics - Excludes staff attendances.  From 1988 include government restructured hospitals and from January 1993 include Anesthesia Department, Singapore General Hospital.  \r\n\r\nAccident & Emergency Departments - Data from 1988 include government restructured hospitals.  \r\n\r\nDental Clinics - Includes dental services in Hospitals, Polyclinics, School Dental Clinics, National Dental Centre.  Prior to 1994, monthly data for NUH Dental Centre are not available.  With effect from January 2006, data includes Changi General Hospital Dental Clinic.  With effect from January 2007, data includes dental clinics at Alexandra Hospital and Tan Tock Seng Hospital.  With effect from March 2010, data includes dental clinics at Khoo Teck Puat Hospital.  \r\n\r\nPolyclinics - Formerly known as family health services.  Community health clinics and maternal and child health clinics were renamed Family Health Services in May 1993.", "lastUpdatedAt": "2024-06-06T14:52:24+08:00", "coverageStart": "1984-01-01T08:00:00+08:00", "coverageEnd": "2020-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Ministry of Health"], "managedBy": "Ministry of Health", "childDatasets": ["d_a5267c58f60b20f8e04576261abfac93", "d_a22337386e9598a83026564c73d2881d"]}, "datasetMetadata": [{"datasetId": "d_a5267c58f60b20f8e04576261abfac93", "createdAt": "2015-07-06T11:18:20+08:00", "name": "Hospital Admissions And Public Sector Outpatient Attendances, Annual", "collectionIds": ["512"], "format": "CSV", "lastUpdatedAt": "2024-06-06T14:52:24+08:00", "managedBy": "Ministry of Health", "coverageStart": "1984-01-01T08:00:00+08:00", "coverageEnd": "2020-12-31T08:00:00+08:00"}, {"datasetId": "d_a22337386e9598a83026564c73d2881d", "createdAt": "2017-04-03T08:59:37+08:00", "name": "Hospital Admissions By Sector, Annual", "collectionIds": ["512"], "format": "CSV", "lastUpdatedAt": "2024-06-06T14:51:50+08:00", "managedBy": "Ministry of Health", "coverageStart": "1984-01-01T08:00:00+08:00", "coverageEnd": "2020-12-31T08:00:00+08:00"}]}, "errorMsg": ""}