{"code": 0, "data": {"collectionMetadata": {"collectionId": "651", "createdAt": "2016-03-22T18:47:40+08:00", "name": "Job Vacancy to Unemployed Person Ratio, Annual", "description": "Source: Labour Market Survey, Manpower Research & Statistics Department, MOM \r\n\r\nJob Vacancies to Unemployed Ratio is calculated by taking the ratio of the estimates of the total number of job vacancies for the whole economy to the total number of unemployed persons.  The number of job vacancies for the whole economy is estimated based on the assumption that private sector establishments with less than 25 employees have the same vacancy rate as private establishments with at least 25 employees. Estimates on the total number of unemployed person are obtained from the Labour Force Survey.\r\n\r\nAnnual figures are the simple averages of the figures obtained at quarterly intervals.", "lastUpdatedAt": "2024-06-06T15:22:06+08:00", "coverageStart": "2002-01-01T08:00:00+08:00", "coverageEnd": "2022-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Ministry of Manpower"], "managedBy": "Ministry of Manpower", "childDatasets": ["d_6530db8211d9538872eb7b1f5dd366d0"]}, "datasetMetadata": [{"datasetId": "d_6530db8211d9538872eb7b1f5dd366d0", "createdAt": "2016-03-23T02:48:18+08:00", "name": "Job Vacancy to Unemployed Person Ratio", "collectionIds": ["651"], "description": "Source: Labour Market Survey, Manpower Research & Statistics Department, MOM\r\n\r\nJob Vacancies to Unemployed Ratio is calculated by taking the ratio of the estimates of the total number of job vacancies for the whole economy to the total number of unemployed persons. The number of job vacancies for the whole economy is estimated based on the assumption that private sector establishments with less than 25 employees have the same vacancy rate as private establishments with at least 25 employees. Estimates on the total number of unemployed person are obtained from the Labour Force Survey.\r\n\r\nAnnual figures are the simple averages of the figures obtained at quarterly intervals.", "format": "CSV", "lastUpdatedAt": "2024-06-06T15:22:06+08:00", "managedBy": "Ministry of Manpower", "coverageStart": "1998-01-01T08:00:00+08:00", "coverageEnd": "2023-01-01T08:00:00+08:00"}]}, "errorMsg": ""}