{"code": 0, "data": {"collectionMetadata": {"collectionId": "341", "createdAt": "2016-04-28T14:57:59+08:00", "name": "Monthly New Registration of Motor Vehicles by Vehicle Quota Categories", "description": "All vehicles newly registered by Vehicle Quota Categories within the report period.\r\n", "lastUpdatedAt": "2024-06-06T14:21:36+08:00", "coverageStart": "2014-01-01T08:00:00+08:00", "coverageEnd": "2020-04-30T08:00:00+08:00", "frequency": "monthly", "sources": ["Land Transport Authority"], "managedBy": "Land Transport Authority", "childDatasets": ["d_06c3969c73ac5ba2d059cf39491ce048"]}, "datasetMetadata": [{"datasetId": "d_06c3969c73ac5ba2d059cf39491ce048", "createdAt": "2016-04-28T23:00:26+08:00", "name": "New Registration of Motor Vehicles Under Vehicle Quota System (VQS)", "collectionIds": ["341"], "description": "* Figures include weekend/off peak cars and tax exempted vehicles.\r\n* Prior to Aug 2012, taxi operators can bid for a new COE or pay Prevailing Quota Premium (PQP) to register a taxi under Category A.\r\n The latter is only in the case of a new taxi that replaces a deregistered one within 6 months.\r\n From 6 Aug 2012 onwards, all taxis pay for COEs based on the PQP of Category A.\r\n* Refers to the Early Turnover Scheme (ETS). Between 24 Apr 2013 and 30 Apr 2016, vehicle owners can de-register their existing\r\n diesel-propelled Category C vehicles that were registered before 1 Jan 2001 and register a replacement vehicle within 1 month of\r\n de-registration by paying a discounted Prevailing Quota Premium (PQP) under the ETS. From 1 Aug 2015, the ETS was extended to\r\n existing diesel-propelled Category C vehicles that were registered between 1 Jan 2001 and 30 Sep 2006 and will be de-registered\r\n between 1 Aug 2015 and 31 Jul 2017.\r\n* Vehicles exempted from the VQS include scheduled and school buses, emergency vehicles, engineering plants primarily for\r\n off-the-road use, diplomatic vehicles and vehicles under the Disabled Person Scheme.\r\n\r\nCars registered with COEs obtained from the Feb 2014 1st bidding exercise onwards:\r\n\r\n* Category A: Cars up to 1600cc and 97kW.\r\n* Category B: Cars above 1600cc or 97kW.\r\n \r\nCars registered with COEs obtained before Feb 2014 bidding exercises:\r\n\r\n* Category A: Cars up to 1600cc.\r\n* Category B: Cars above 1600cc.\r\n\r\nM02-New Reg by Quota", "format": "CSV", "lastUpdatedAt": "2024-06-06T14:21:36+08:00", "managedBy": "Land Transport Authority", "coverageStart": "2014-01-01T08:00:00+08:00", "coverageEnd": "2020-04-30T08:00:00+08:00"}]}, "errorMsg": ""}