{"code": 0, "data": {"collectionMetadata": {"collectionId": "434", "createdAt": "2016-01-05T18:39:59+08:00", "name": "Percentage of P1 Cohort that Progressed to Post-Secondary Education", "description": "Note:\r\n\r\n1) Refers to the year in which the typical student in that particular cohort would progressed to a post-secondary education institution (10 years after P1).\r\n\r\n2) Figures for 2016-2020 are preliminary as students from the same cohort could be admitted to post-secondary education institutions later.\r\n\r\n3) Figures include participation in Junior Colleges, Millennia Institute, Polytechnics, Institute of Technical Education (ITE), LASALLE College of the Arts, Nanyang Academy of Fine Arts and other private education institutions, and take into account students who have left the country. From 2015 onwards, figures also include participation in Privately-Funded Schools and Foreign System Schools.\r\n  ", "lastUpdatedAt": "2024-12-09T09:27:50+08:00", "coverageStart": "1995-01-01T08:00:00+08:00", "coverageEnd": "2021-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Ministry of Education"], "managedBy": "Ministry of Education", "childDatasets": ["d_d9c3dc47a770f8eb2f31432681558f36"]}, "datasetMetadata": [{"datasetId": "d_d9c3dc47a770f8eb2f31432681558f36", "createdAt": "2016-01-05T18:49:38+08:00", "name": "Percentage of P1 Cohort who Progressed to Post-Secondary Education", "collectionIds": ["434"], "description": "(1) Refers to the year in which a typical student in that particular cohort would progress to post-secondary education programmes (i.e., 10 years after P1).\t\n\n(2) The figures include Singapore Citizens (SC) and Permanent Residents (PR) only, and exclude International Students (IS).\n\t\t\t\t\t\n(3) Figures include participation in Junior Colleges, Millennia Institute, Polytechnics, Institute of Technical Education, LASALLE College of the Arts, Nanyang Academy of Fine Arts and other private education institutions, and take into account students who have left the country. From 2015 onwards, figures also include participation in Privately-Funded Schools and Foreign System Schools. \n\t\t\t\t\t\t\t\t\t\t\n(4) Figures for the last 5 years are preliminary estimates as these cohorts have not been fully tracked.\t", "format": "CSV", "lastUpdatedAt": "2024-12-09T09:27:50+08:00", "managedBy": "Ministry of Education", "coverageStart": "1995-01-01T08:00:00+08:00", "coverageEnd": "2023-01-01T08:00:00+08:00"}]}, "errorMsg": ""}