{"code": 0, "data": {"collectionMetadata": {"collectionId": "433", "createdAt": "2020-08-12T10:51:27+08:00", "name": "Percentage of P1 Cohort  Admitted to Post-Secondary and Tertiary Education by Type of Course", "description": "Note: \r\n\r\n1. Figures for indicators percentage of P1 admitted to Nitec / Higher Nitec Courses (full-time),  Publicly-Funded Diploma Courses (full-time) and Pre-U Courses are based on P1 Cohort from 10 years prior of reporting.  Indicator for Percentage of P1 Cohort Admitted to Publicly-Funded Degree Courses (full-time) is based on P1 Cohort from 12 years prior to the year of reporting\r\n \r\n2. Figures for Publicly-Funded Diploma Courses include participation in diploma courses offered by the five Polytechnics, ITE, LASALLE College of the Arts and Nanyang Academy of Fine Arts.\r\n \r\n3. Figures for Publicly-Funded Degree Courses include participation in publicly-funded degree programmes in NUS, NTU, SMU, SIT, SUTD, LASALLE College of the Arts and Nanyang Academy of Fine Arts.\r\n \r\n4. Students who enrol in one course may progress subsequently to another course and are accounted for under both types of courses. For example, polytechnic students who progress to university will be accounted for under both publicly-funded diploma and degree courses", "lastUpdatedAt": "2024-12-09T09:30:07+08:00", "coverageStart": "2003-01-01T08:00:00+08:00", "coverageEnd": "2021-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Ministry of Education"], "managedBy": "Ministry of Education", "childDatasets": ["d_77af1549353613193ae58aebe56a8e04"]}, "datasetMetadata": [{"datasetId": "d_77af1549353613193ae58aebe56a8e04", "createdAt": "2020-08-12T10:54:05+08:00", "name": "Percentage of P1 Cohort Admitted to Post-Secondary and Tertiary Education by Type of Course", "collectionIds": ["433"], "description": "(1) Students who enrol in one course may progress subsequently to another course and are accounted for under both types of courses. For example, polytechnic students who progress to university will be accounted for under both publicly-funded diploma and degree courses. Figures for admission to (i) Nitec / Higher Nitec Courses (full-time), (ii) Publicly-Funded Diploma Courses (full-time), and (iii) Pre-University Courses are based on the P1 cohort from 10 years prior to the year of reporting, while (iv) Publicly-Funded Degree Courses (full-time) is based on the P1 cohort from 12 years prior to the year of reporting. \n\n(2) Publicly-funded diploma courses are offered by the five polytechnics, ITE, LASALLE and NAFA.\n\n(3) Publicly-funded degree courses are offered by NUS, NTU, SMU, SUTD, SIT, SUSS, LASALLE and NAFA.\n\n(4) Figures for the last five years are preliminary.", "format": "CSV", "lastUpdatedAt": "2024-12-09T09:30:07+08:00", "managedBy": "Ministry of Education", "coverageStart": "2003-01-01T08:00:00+08:00", "coverageEnd": "2023-01-01T08:00:00+08:00"}]}, "errorMsg": ""}