{"code": 0, "data": {"collectionMetadata": {"collectionId": "178", "createdAt": "2021-10-25T19:32:16+08:00", "name": "Sample Household Survey: Employed HDB Resident Population Aged 15 Years and Above by Occupation", "description": "Data is derived from the Sample Household Survey (SHS) which is conducted once every 5 years. HDB resident population refers to Singapore citizens and Singapore permanent residents (SPRs) residing in HDB flats. They include owners/co-owners, HDB rental tenants and occupiers.\r\n\r\nFigures may not add to 100% due to rounding.", "lastUpdatedAt": "2024-06-06T15:09:52+08:00", "coverageStart": "2013-01-01T08:00:00+08:00", "coverageEnd": "2018-12-31T08:00:00+08:00", "frequency": "other", "sources": ["Housing & Development Board"], "managedBy": "Housing & Development Board", "childDatasets": ["d_fcfc5a44d2e3d783b895f4b4016b84d9", "d_9c6271959306ec3d2726f1fc296794e8"]}, "datasetMetadata": [{"datasetId": "d_fcfc5a44d2e3d783b895f4b4016b84d9", "createdAt": "2021-10-25T19:47:04+08:00", "name": "Employed HDB Resident Population by Occupation and Age", "collectionIds": ["178"], "description": "Employed persons refer to persons aged 15 years old and above who, at the point of survey: (i) worked for one hour or more either for pay or profit; or (ii) have a job or business to return to but were temporarily absent because of illness, injury, breakdown of machinery at workplace, labour management dispute or other reasons. Members of the Singapore Armed Forces including full-time National Servicemen were included in the persons employed, unless otherwise specified", "format": "CSV", "lastUpdatedAt": "2024-06-06T15:09:52+08:00", "managedBy": "Housing & Development Board", "coverageStart": "2013-01-01T08:00:00+08:00", "coverageEnd": "2018-12-31T08:00:00+08:00"}, {"datasetId": "d_9c6271959306ec3d2726f1fc296794e8", "createdAt": "2021-10-25T19:42:06+08:00", "name": "Employed HDB Resident Population by Occupation and Sex", "collectionIds": ["178"], "description": "Employed persons refer to persons aged 15 years old and above who, at the\r\npoint of survey:\r\n(i) worked for one hour or more either for pay or profit; or\r\n(ii) have a job or business to return to but were temporarily absent because of\r\nillness, injury, breakdown of machinery at workplace, labour management\r\ndispute or other reasons.\r\nMembers of the Singapore Armed Forces including full-time National Servicemen\r\nwere included in the persons employed, unless otherwise specified", "format": "CSV", "lastUpdatedAt": "2024-06-06T14:50:41+08:00", "managedBy": "Housing & Development Board", "coverageStart": "2013-01-01T08:00:00+08:00", "coverageEnd": "2018-12-31T08:00:00+08:00"}]}, "errorMsg": ""}