{"code": 0, "data": {"collectionMetadata": {"collectionId": "252", "createdAt": "2016-08-17T15:02:46+08:00", "name": "Stamp Duty Assessed for Private Residential Properties, Annual", "description": "Number of transactions and amount of stamp duty assessed on private residential properties for Buyer's Stamp Duty, Additional Buyer's Stamp Duty and Seller's Stamp Duty for Calendar Year (CY)2011 to CY2022.\r\n\r\n* Additional Buyer’s Stamp Duty (ABSD) is imposed on certain groups of people who buy (or acquire) residential properties or the part for residential purposes in the case of properties with mixed purposes on or after 8 December 2011. For more information, please refer to IRAS Website on ABSD: https://www.iras.gov.sg/IRASHome/Other-Taxes/Stamp-Duty-for-Property/Working-out-your-Stamp-Duty/Buying-or-Acquiring-Property/What-is-the-Duty-that-I-Need-to-Pay-as-a-Buyer-or-Transferee-of-Residential-Property/Additional-Buyer-s-Stamp-Duty--ABSD-/ \r\n* Seller’s Stamp Duty (SSD) is imposed on sellers who buy (or acquire) residential properties or the part for residential purposes in the case of properties with mixed purposes on or after 20 February 2010 and sell (or disposed of) them within certain duration. For more information, please refer to IRAS Website on Seller's Stamp Duty: https://www.iras.gov.sg/irashome/Other-Taxes/Stamp-Duty-for-Property/Working-out-your-Stamp-Duty/Selling-or-Disposing-Property/Seller-s-Stamp-Duty--SSD--for-Residential-Property/", "lastUpdatedAt": "2024-09-19T12:03:55+08:00", "coverageStart": "2011-01-01T08:00:00+08:00", "coverageEnd": "2022-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Inland Revenue Authority of Singapore"], "managedBy": "Inland Revenue Authority of Singapore", "childDatasets": ["d_38070327ca83c81887289a5c09d3c545"]}, "datasetMetadata": [{"datasetId": "d_38070327ca83c81887289a5c09d3c545", "createdAt": "2016-08-17T23:04:18+08:00", "name": "Stamp Duty Assessed for Private Residential Properties", "collectionIds": ["252"], "description": "* The statistics are based on date of execution of the Sale & Purchase document. \r\n* Private residential properties include executive condominiums but exclude residential land.\r\n* The statistics for CY2011 and CY2012 are based on stamped documents received by 31 March 2013. From CY2013 onwards, statistics are based on documents stamped by 31 March of the following year (e.g. CY2013 statistics are based on documents stamped by 31 March 2014)\r\n* The statistics are derived based on unique count of properties transferred.\r\n* The number of transactions for ABSD is included in the number of transactions for BSD because every transaction that attracts ABSD would also attract BSD.\r\n* The amount of ABSD assessed is not included in the BSD amount.\r\n* From CY2014 onwards, statistics will exclude transactions which are subsequently remitted/aborted.\r\n* There will be differences between the Stamp Duty Assessed (SDA) and the Tax Collection for Stamp Duty published on data.gov.sg. SDA is the net stamp duty payable or repayable, excluding transactions which are subsequently remitted/ aborted, while Tax Collection is the total net amount of stamp duties collected, taking into account any tax refunds, adjustments and remissions.", "format": "CSV", "lastUpdatedAt": "2024-09-19T12:03:55+08:00", "managedBy": "Inland Revenue Authority of Singapore"}]}, "errorMsg": ""}