{"code": 0, "data": {"collectionMetadata": {"collectionId": "249", "createdAt": "2016-06-27T18:38:38+08:00", "name": "Tax Rates for Betting Taxes", "description": "Tax/duty rates for Gaming Duties and Casino Tax for Year 2003 to Year 2023", "lastUpdatedAt": "2024-09-02T17:07:21+08:00", "coverageStart": "2003-01-01T08:00:00+08:00", "coverageEnd": "2023-12-31T08:00:00+08:00", "frequency": "ad-hoc", "sources": ["Inland Revenue Authority of Singapore"], "managedBy": "Inland Revenue Authority of Singapore", "childDatasets": ["d_2d16ccf3773d3d98b749b3381db6b60a"]}, "datasetMetadata": [{"datasetId": "d_2d16ccf3773d3d98b749b3381db6b60a", "createdAt": "2016-06-28T02:39:19+08:00", "name": "Tax Rates for Betting Taxes", "collectionIds": ["249"], "description": "* The Gambling Duties Act 2022 (“GDA”) and Gambling Duties Regulations 2022 (“GD Regs\") were enacted on 29 July 2022 to consolidate the laws on the levy and collection of duties on lawful betting and lotteries in Singapore. Prior to 29 July 2022, the duties are collected under the Private Lotteries Act 2011 (“PLA”), Betting and Sweepstake Duties Act (“BSDA”) and Betting and Sweepstake Duties Order (“BSDO”). With the entry into effect of the new GDA and GD Regs and the Gambling Control Act 2022, the PLA, BSDA and BSDO have been repealed and “Private Lotteries Duty” and “Betting Duty” will be renamed “Gambling Duties”.\n* A “Gaming machine” is defined under S7(6) of the Gambling Control Act 2022 and a “Jackpot machine or Fruit Machine” is an illustration of a “gaming machine”.\n* Sports Betting includes Football and Motor Racing.\n* Gross Gaming Revenue at Tier 1 casino tax rates apply to a casino operator for any period during the moratorium period (that is, a period of 10 years starting 1 March 2022) if the casino operator satisfactorily meets the targets relevant to the development of facilities and services of the casino operator's integrated resort (\"Development Targets\") for the purposes of Section 146(3) of the Casino Control Act 2006 (\"CCA\").", "format": "CSV", "lastUpdatedAt": "2024-09-02T17:07:21+08:00", "managedBy": "Inland Revenue Authority of Singapore"}]}, "errorMsg": ""}