{"code": 0, "data": {"collectionMetadata": {"collectionId": "250", "createdAt": "2016-06-27T18:04:51+08:00", "name": "Tax Rates for Corporate Income Tax", "description": "Tax rates for Corporate Income Tax for Year of Assessment (YA)2003 to YA2023.", "lastUpdatedAt": "2024-09-02T18:43:07+08:00", "coverageStart": "2003-01-01T08:00:00+08:00", "coverageEnd": "2023-12-31T08:00:00+08:00", "frequency": "ad-hoc", "sources": ["Inland Revenue Authority of Singapore"], "managedBy": "Inland Revenue Authority of Singapore", "childDatasets": ["d_0860d31926593c4d09cc49d0d8dafeca"]}, "datasetMetadata": [{"datasetId": "d_0860d31926593c4d09cc49d0d8dafeca", "createdAt": "2016-08-11T00:38:18+08:00", "name": "Tax Rates for Corporate Income Tax", "collectionIds": ["250"], "description": "* For Year of Assessment (YA) 2003 to 2007, a partial tax exemption is given up to S$100,000 of the company's chargeable income (excluding Singapore franked dividends) that is subject to tax at the normal corporate tax rate as follows:\n\t- 75% tax exemption for the first S$10,000 chargeable income\n\t- 50% tax exemption for the next S$90,000 chargeable income\n* Effective from YA 2008, the threshold for partial tax exemption has been increased to S$300,000 as follows:\n\t- 75% tax exemption for the first S$10,000 normal chargeable income\n\t- 50% tax exemption for the next S$290,000 normal chargeable income\n* Effective from YA 2020, the threshold for partial tax exemption has been reduced to S$200,000 as follows:\n\t- 75% tax exemption for the first S$10,000 normal chargeable income\n\t- 50% tax exemption for the next S$190,000 normal chargeable income\n* Effective from YA 2005, for qualifying new start-up companies, full tax exemption is given up to S$100,000 of the company’s chargeable income (excluding Singapore franked dividends) that is subject to tax at the normal corporate tax rate for the first three consecutive YAs. From YA 2008, the threshold for tax exemption has been increased to S$300,000 as follows:\n  \t- 100% tax exemption for the first S$100,000 normal chargeable income\n\t- 50% tax exemption for the next S$200,000 normal chargeable income\n* From YA 2020, the tax exemption to be granted to qualifying new start-up companies for each applicable YA is adjusted as follows:\n\t- 75% tax exemption for the first S$100,000 normal chargeable income\n\t- 50% tax exemption for the next S$100,000 normal chargeable income\n\n* Normal chargeable income refers to income to be taxed at the prevailing corporate tax rate. \n\n* For YA 2011, a tax rebate of 20% capped at S$10,000 or cash grant of 5% of revenue capped at S$5,000, whichever is higher is given. The 20% tax rebate is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).\t\n* For YA 2012, a cash grant of 5% of revenue capped at S$5,000 is given.\n* For YA 2013 to 2015, a tax rebate of 30% capped at S$30,000 per YA is given. The 30% tax rebate is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).\n* For YA 2016, a tax rebate of 50% capped at S$20,000 is given. The 50% tax rebate is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).\n* For YA 2017, a tax rebate of 50% capped at S$25,000 is given. The 50% tax rebate is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).\n* For YA 2018, a tax rebate of 40% capped at S$15,000 is given. The 40% tax rebate is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).\n* For YA 2019, a tax rebate of 20% capped at S$10,000 is given. The 20% tax rebate is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).\n* For YA 2020, a tax rebate of 25% capped at S$15,000 is given. The 25% tax rebate is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).\n* For YA 2024, a cash payout of S$2,000 (for eligible companies which have employed at least one local employee in 2023) or a tax rebate of 50% (capped at S$40,000), whichever is the higher amount, is given. The 50% tax rebate  is on tax payable (excluding tax on income subject to final withholding tax and tax deducted at source).  ", "format": "CSV", "lastUpdatedAt": "2024-09-02T18:43:07+08:00", "managedBy": "Inland Revenue Authority of Singapore"}]}, "errorMsg": ""}