{"code": 0, "data": {"collectionMetadata": {"collectionId": "263", "createdAt": "2016-08-17T17:09:48+08:00", "name": "Tax Arrears, Annual", "description": "Tax arrears for Individual Income Tax, Corporate Income Tax, Property Tax and Goods and Services Tax for Financial Year (FY)2002 to FY2022.\r\n\r\n* All figures are as at 31 March of each Financial Year.", "lastUpdatedAt": "2024-09-04T00:16:20+08:00", "coverageStart": "2002-04-01T08:00:00+08:00", "coverageEnd": "2023-03-31T08:00:00+08:00", "frequency": "annual", "sources": ["Inland Revenue Authority of Singapore"], "managedBy": "Inland Revenue Authority of Singapore", "childDatasets": ["d_826a5ab77f5de4da99fc5563b204821b", "d_703c301bd5bfab17f2bc2390b49b0d6f"]}, "datasetMetadata": [{"datasetId": "d_826a5ab77f5de4da99fc5563b204821b", "createdAt": "2016-09-03T00:54:34+08:00", "name": "Tax Arrears by Tax Type", "collectionIds": ["263"], "description": "* Starting from FY2004/05, tax arrears for previous year excludes inactive arrears. Inactive arrears are those where all enforcement actions appropriate to these cases have been applied but tax recovery has not been successful. These cases include strike-off, deregistration, dissolution, receivership, liquidation or judicial management in the case of companies, and bankruptcy or death in the case of individuals.\n* Starting from FY2014/15, property tax arrears are reported on a calendar year basis to better align it with the annual cycle of property tax bills due on 31 January.\n* Starting from FY2015/16, tax arrears include taxes assessed in past years which are under instalment arrangement.\n* We have updated the statistics from FY2015/16 onwards to include additional data for completeness. Revisions were not made to prior years due to data availability limitations.", "format": "CSV", "lastUpdatedAt": "2024-09-04T00:16:20+08:00", "managedBy": "Inland Revenue Authority of Singapore"}, {"datasetId": "d_703c301bd5bfab17f2bc2390b49b0d6f", "createdAt": "2016-08-18T01:13:22+08:00", "name": "Arrears Rate", "collectionIds": ["263"], "description": "* Arrears Rate is the proportion of current financial year arrears of Individual Income Tax, Corporate Income Tax, Goods & Services Tax and Property Tax to total net tax assessed or collection as at the end of each financial year. Net tax assessed is the net tax payable or repayable after taking into account allowable tax credits, tax remission, tax rebates and tax deducted at source.", "format": "CSV", "lastUpdatedAt": "2024-09-04T00:03:59+08:00", "managedBy": "Inland Revenue Authority of Singapore"}]}, "errorMsg": ""}