{"code": 0, "data": {"collectionMetadata": {"collectionId": "259", "createdAt": "2016-06-27T18:21:03+08:00", "name": "Tax Rates for Individual Income Tax", "description": "Tax rates for Individual Income Tax for Year of Assessment (YA)2003 to YA2023.", "lastUpdatedAt": "2024-09-02T18:32:44+08:00", "coverageStart": "2003-01-01T08:00:00+08:00", "coverageEnd": "2023-12-31T08:00:00+08:00", "frequency": "ad-hoc", "sources": ["Inland Revenue Authority of Singapore"], "managedBy": "Inland Revenue Authority of Singapore", "childDatasets": ["d_f73055c69144d2e7734c28811d3982aa"]}, "datasetMetadata": [{"datasetId": "d_f73055c69144d2e7734c28811d3982aa", "createdAt": "2016-06-28T02:23:38+08:00", "name": "Tax Rates for Individual Income Tax", "collectionIds": ["259"], "description": "* With effect from Year of Assessment 2003, the one-off GST rebate of S$250 (available in YA2002) and the personal relief of S$3,000 are no longer available as they have been incorporated into the personal income tax rate structure.\n* For Year of Assessment (YA) 2008, 2009 and 2011, there is a one-off personal tax rebate of 20% given to all tax resident individuals, up to S$2,000 per taxpayer.\n* For Year of Assessment 2013, a personal tax rebate of up to a maximum of S$1,500 is given to all tax resident individuals as follows:\n\t- 30% rebate for taxpayers of age below 60 years as at 31 December 2012\n\t- 50% rebate for taxpayers of age 60 years and above as at 31 December 2012\t\n* For Year of Assessment 2015, a personal tax rebate of 50% of tax payable, up to a maximum of S$1,000, is granted to all tax resident individuals.\n* For Year of Assessment 2017, a personal tax rebate of 20% of tax payable, up to a maximum of S$500, is granted to all tax resident individuals.\n* From Year of Assessment 2018, the total amount of personal income tax reliefs which an individual can be allowed is subject to an overall relief cap of S$80,000 per year.\n* For Year of Assessment 2019, a personal tax rebate of 50% of tax payable, up to a maximum of S$200, is granted to all tax resident individuals.\n* As announced during Budget 2022, individual income tax rates will be revised from YA2024 onwards. More details on the new tax rates can be found here. \nhttps://www.iras.gov.sg/taxes/individual-income-tax/basics-of-individual-income-tax/tax-residency-and-tax-rates/individual-income-tax-rates \n* For Year of Assessment 2024, a personal tax rebate of 50% of tax payable, up to a maximum of S$200, is granted to all tax resident individuals.     ", "format": "CSV", "lastUpdatedAt": "2024-09-02T18:32:44+08:00", "managedBy": "Inland Revenue Authority of Singapore"}]}, "errorMsg": ""}