{"code": 0, "data": {"collectionMetadata": {"collectionId": "254", "createdAt": "2016-08-17T12:12:18+08:00", "name": "Taxable Individuals by Assessable Income Group, Annual", "description": "Number of individuals, amount of assessable income, chargeable income and net tax assessed of taxable tax resident and non-tax resident individuals by assessable income ranges for Year of Assessment (YA)2004 to YA2022. Income is assessed on a preceding year basis. The period of income relevant to the YA is the year preceding the YA.\r\n\r\n* All figures are as at 31 March of the following year for each Year of Assessment (i.e. the YA2022 figures are as at 31 March 2023).", "lastUpdatedAt": "2024-09-04T00:39:30+08:00", "coverageStart": "2004-01-01T08:00:00+08:00", "coverageEnd": "2022-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Inland Revenue Authority of Singapore"], "managedBy": "Inland Revenue Authority of Singapore", "childDatasets": ["d_f394f202534237671d39b17bd3b506ec"]}, "datasetMetadata": [{"datasetId": "d_f394f202534237671d39b17bd3b506ec", "createdAt": "2016-10-03T17:35:22+08:00", "name": "Taxable Individuals by Assessed Income Group", "collectionIds": ["254"], "description": "* Assessable Income refers to the total income of an individual less allowable deductions such as business expenses, employment expenses and donations.\n* Chargeable Income of an individual is his/her assessable income less the personal reliefs allowed.\n* Net Tax Assessed is the net tax payable or repayable by an individual after taking into account allowable tax credits, tax remission, tax rebates and tax deducted at source.\n* Non-Tax Resident refers to an individual who has worked in Singapore for less than 183 days in the preceding year of the Year of Assessment.\n* There will be differences between the Net Tax Assessed (NTA) and the Tax Collection published on data.gov.sg. NTA is the net tax assessed to be payable or repayable by an entity after taking into account allowable tax credits, tax remission, tax rebates and tax deducted at source, for a specific tax period. This might be different from the amount of tax collected as the taxes could be collected or refunded across different Financial Years (FY) due to taxpayers paying their taxes via GIRO instalments or having their past years’ assessments reviewed.", "format": "CSV", "lastUpdatedAt": "2024-09-04T00:39:30+08:00", "managedBy": "Inland Revenue Authority of Singapore"}]}, "errorMsg": ""}