{"code": 0, "data": {"collectionMetadata": {"collectionId": "1493", "createdAt": "2018-11-07T19:16:29+08:00", "name": "Tree Conservation Area", "description": "On 2 August 1991, in an effort to control indiscriminate felling of mature trees, two areas in the South Central and Eastern parts of Singapore were gazetted as Tree Conservation Areas [under the Parks and Trees (Preservation of Trees) Order 1991]. The two Tree Conservation Areas (TCAs) were selected based on the extent of greenery and the number of mature trees within the areas that are worth conserving. These mature trees provide the lush verdant and wooded ambience to enhance the beauty of the environment. Some of these trees have taken as long as 50 to 100 years to reach their present size.\r\n\r\nThe gazette requires written permission for proposals to fell any mature tree to be obtained from the Commissioner of Parks & Recreation. Mature trees are defined as trees with girth more than one metre measured half a metre from the ground. This applies to developers as well as owners of private properties and even if no development works are being undertaken.\r\n\r\nThis dataset presents the indicative extent of the two TCAs.", "lastUpdatedAt": "2024-11-25T12:40:56+08:00", "frequency": "other", "sources": ["National Parks Board"], "managedBy": "National Parks Board", "childDatasets": ["d_52b9eabe398353bd6acd9aee15b13f72"]}, "datasetMetadata": [{"datasetId": "d_52b9eabe398353bd6acd9aee15b13f72", "createdAt": "2023-07-31T17:26:36+08:00", "name": "Tree Conservation Area", "collectionIds": ["1493"], "description": "On 2 August 1991, in an effort to control indiscriminate felling of mature trees, two areas in the South Central and Eastern parts of Singapore were gazetted as Tree Conservation Areas [under the Parks and Trees (Preservation of Trees) Order 1991]. The two Tree Conservation Areas (TCAs) were selected based on the extent of greenery and the number of mature trees within the areas that are worth conserving. These mature trees provide the lush verdant and wooded ambience to enhance the beauty of the environment. Some of these trees have taken as long as 50 to 100 years to reach their present size. The gazette requires written permission for proposals to fell any mature tree to be obtained from the Commissioner of Parks & Recreation. Mature trees are defined as trees with girth more than one metre measured half a metre from the ground. This applies to developers as well as owners of private properties and even if no development works are being undertaken. This dataset presents the indicative extent of the two TCAs.", "format": "GEOJSON", "lastUpdatedAt": "2024-11-25T12:40:56+08:00", "managedBy": "National Parks Board"}]}, "errorMsg": ""}