{"code": 0, "data": {"collectionMetadata": {"collectionId": "1663", "createdAt": "2016-06-08T10:46:45+08:00", "name": "Unsold Private Residential Units with Planning Approvals by Market Segment, Quarterly", "description": "With Pre-Requisites for Sale : Refers to private residential developments with Housing Developer Licence and Building Plan Approval. Under the Housing Developer (Control and Licensing) Act, a sale licence must be obtained for a project with more than 4 units, if the developer intends to sell uncompleted residential units in the development. However, the sale of the residential units can only commence with the approval of the building plans of the development.\r\n\r\nWithout Pre-Requisites for Sale but with planning approvals : Refers to uncompleted private residential developments without pre-requisites for sale but with Written Permission or Provisional Permission granted\r\n\r\nCompleted Units : Refers to unsold units in completed projects which are still licensed\r\n\r\nCore Central Region : Core Central Region comprises Postal Districts 9, 10, 11, Downtown Core Planning Area and Sentosa. A map of Central Region showing the Core Central Region (CCR)  and  the Rest of Central Region (RCR) is available at: https://spring.ura.gov.sg/lad/ore/login/map_ccr.pdf\r\n\r\nRest of Central Region : Rest of Central Region comprises the area within Central Region that is outside postal districts 9, 10, 11, Downtown Core Planning Area and Sentosa. A map of Central Region showing the Core Central Region (CCR) and the Rest of Central Region (RCR) is available at: https://spring.ura.gov.sg/lad/ore/login/map_ccr.pdf\r\n\r\nOutside Central Region: Outside Central Region (OCR) refers to the planning areas which are outside the Central Region.", "lastUpdatedAt": "2024-06-06T15:28:03+08:00", "coverageStart": "2006-07-01T08:00:00+08:00", "coverageEnd": "2023-06-30T08:00:00+08:00", "frequency": "quarterly", "sources": ["Urban Redevelopment Authority"], "managedBy": "Urban Redevelopment Authority", "childDatasets": []}, "datasetMetadata": []}, "errorMsg": ""}