{"code": 0, "data": {"collectionMetadata": {"collectionId": "230", "createdAt": "2016-05-03T17:37:14+08:00", "name": "Web Presence of Enterprises by Employment Size", "description": "The annual survey on Infocomm Usage by Enterprises is carried out by the Research and Statistics Unit of the Infocomm Development Authority of Singapore since 1999. This survey is conducted under the Statistics Act (Chapter 317) which empowers the Director of the Research and Statistics Unit to collect data on the infocomm activities in Singapore. The Act also guarantees the confidentiality of individual information obtained from the survey. \r\n\r\nMethodology\r\n\r\nThis survey aims to gauge the levels and types of infocomm adoption and usage in enterprises in Singapore; and identify the barriers to infocomm adoption. Representative samples of infocomm and end-user enterprises were selected from the Department of Statistics’ (DOS) Establishment Sampling Frame.\r\n\r\nA web presence means a website (including mobile versions) or any other web pages where the business has control over the content of the page such as home page, or presence on another entity's website (including a related business), or blogsites, or pages on social media platforms or online business directories or online marketplaces.\r\n", "lastUpdatedAt": "2024-06-06T15:09:06+08:00", "coverageStart": "2012-01-01T08:00:00+08:00", "coverageEnd": "2016-12-31T08:00:00+08:00", "frequency": "annual", "sources": ["Info-communications Media Development Authority"], "managedBy": "Info-communications Media Development Authority", "childDatasets": ["d_f836f9bce300b89ebc7685ef9df1b822"]}, "datasetMetadata": [{"datasetId": "d_f836f9bce300b89ebc7685ef9df1b822", "createdAt": "2016-05-04T01:38:21+08:00", "name": "Web Presence of Enterprises by Employment Size", "collectionIds": ["230"], "format": "CSV", "lastUpdatedAt": "2024-06-06T15:09:06+08:00", "managedBy": "Info-communications Media Development Authority", "coverageStart": "2012-01-01T08:00:00+08:00", "coverageEnd": "2016-12-31T08:00:00+08:00"}]}, "errorMsg": ""}